Tekla Open API Reference for Tekla Structures 2025
WpfShapeCatalog Class
 The WpfShapeCatalog class represents a group of controls to select shapes using the shape catalog.
 WpfShapeCatalog
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ContentControl
 System.Windows.Controls.UserControl
 Tekla.Structures.Dialog.UIControls.WpfShapeCatalog
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class WpfShapeCatalog : UserControl,
	IComponentConnector
Public Class WpfShapeCatalog
	Inherits UserControl
	Implements IComponentConnector
The WpfShapeCatalog type exposes the following members.
Constructors
Name | Description
WpfShapeCatalog()
 Initializes a new instance of the ShapeCatalog class.
WpfShapeCatalog(String)
 Initializes a new instance of the ShapeCatalog class and will select the Shape (if available) in the tree.
Top
Properties
Name | Description
ButtonHeight
 Gets and sets the height of the button control.
ButtonText
 Gets and sets the text of the button control.
ButtonWidth
 Gets and sets the width of the button control.
SelectedShape
 Gets or sets the selected Shape in the control.
Top
Methods
Name | Description
InitializeComponent
 InitializeComponent
OnValueChanged
 Event handler for passing generic catalog data back to dialog
Top
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the selection has been done.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace